onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Д_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Денисов В.Е 10.08.2024 ТЗ 1 От Домашнее задание Нетологии13-7
	ДобавитьСогласованнуюСкидку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
//Денисов В.Е 10.08.2024 ТЗ №1 От Домашнее задание Нетологии13-7
	//В ТЧ добавлен новый реквизит, необходимо включить настроить правильность его работы
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100; 
	
	//Переопределим данную строку
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;

	ОбщийПроцентСкидки = ТекущиеДанные.Скидка + Объект.Д_СогласованнаяСкидка; 
	Если ОбщийПроцентСкидки > 100 Тогда
		//Сообщение = новый СообщениеПользователю;
		ТекстСообщения = СтрШаблон("Суммарная скидка на %1 превышает 100%%",ТекущиеДанные.Номенклатура);
		Поле = "ТекущиеДанные.Скидка";
		ПутьКДанным = "Объект";
		//Сообщение.Сообщить(); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,Поле,ПутьКДанным);

		ОбщийПроцентСкидки = 100;
	КонецЕсли;
	

	//Денисов В.Е 10.08.2024 ТЗ №1 От Домашнее задание Нетологии13-7
	Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
	//Раньше Объект.Д_СогласованнаяСкидка, сейчас  ОбщийПроцентСкидки
	ТекущиеДанные.Сумма = Сумма - (Сумма * ОбщийПроцентСкидки / 100);
	//КонецЗадачи

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область Доработки

//Программно добавить поле "Согласованная скидка" и кнопку пересчёта тч 
&НаСервере
Процедура ДобавитьСогласованнуюСкидку()
	
	Группа = Элементы.Вставить("ГруппаСолгасованнаяСкидка",Тип("ГруппаФормы"),ЭтаФорма,Элементы.Страницы);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	НовыйЭлемент = Элементы.Вставить("Д_СогласованнаяСкидка",Тип("ПолеФормы"),Элементы.ГруппаСолгасованнаяСкидка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","Д_СогласованнаяСкидкаПриИзменении");
	
	Команда = Команды.Добавить("ПересчитатьСоСкидкой");
	Команда.Заголовок = "ПересчитатьСоСкидкой";
	Команда.Действие = "КомандаПересчитатьСоСкидкой";
	
	КнопкаФормы = Элементы.Вставить("КнопкаПересчитатьСоСкидкой",Тип("КнопкаФормы"),Элементы.ГруппаСолгасованнаяСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьСоСкидкой";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	КнопкаФормы.Видимость = Истина;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	

КонецПроцедуры 

//При нажатии команды
&НаКлиенте
Процедура КомандаПересчитатьСоСкидкой (Команда)

	КомандаПересчитатьСоСкидкойСервер();
	
КонецПроцедуры

//Действие,выполняемое командой
&НаКлиенте
Процедура КомандаПересчитатьСоСкидкойСервер()
		
	Для Каждого ЭлементТЧ ИЗ Объект.Услуги Цикл
		РассчитатьСуммуСтроки(ЭлементТЧ);
	КонецЦикла; 
	
	
	Для Каждого ЭлементТЧ ИЗ Объект.Товары Цикл
	РассчитатьСуммуСтроки(ЭлементТЧ);
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры 

//Задаёт вопрос при изменении значения "СогласованнаяСкидка"
&НаКлиенте
Асинх Процедура Д_СогласованнаяСкидкаПриИзменении(Элемент)
	ТекстВопроса = "Вы уверены, что необходимо пересчитать со скидкой?";
	
	ВариантыОтвета = Новый СписокЗначений;
	ВариантыОтвета.Вставить("0","Нет");
	ВариантыОтвета.Вставить("1","Да");
	
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса,ВариантыОтвета,,"Да"); 
	
	Если ОтветПользователя = "Нет" Тогда 
		Возврат;
	ИначеЕсли ОтветПользователя = "Да" Тогда
		КомандаПересчитатьСоСкидкойСервер();
	КонецЕсли;  
	
	

КонецПроцедуры


#КонецОбласти
